app/controllers/articles_controller.rb

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-10-30 22:21:42.765250"], ["id", 1]]
---
  def update
    @article.update(
      title: params[:article][:title],
      description: params[:article][:description]
    )